Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-26-37.tmx
Source language: bo
Languages: en

source: །ཆོས་ཐམས་ཅད་ཀྱི་རྒྱུས་ཤེས་པར་བྱ་བ་ལ་མངོན་དུ་གྱུར་པ་དང་། སངས་རྒྱས་ཐམས་ཅད་མཆོད་ཅིང་རིམ་གྲོར་བྱ་བ་ལ་མངོན་དུ་གྱུར་པ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་བསྟན་པ་ཡོངས་སུ་གཟུང་བ་ལ་མངོན་དུ་གྱུར་པ་དང་། དགེ་བའི་རྩ་བ་ཐམས་ཅད་བསྩགས་པ་ལ་མངོན་དུ་གྱུར་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐམས་ཅད་རྣམ་པར་འཕེལ་བར་བྱ་བ་ལ་མངོན་དུ་གྱུར་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ལ་སྒྲིབ་པ་མེད་པར་མངོན་དུ་གྱུར་པར་གནས་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་པོ་ཡོངས་སུ་སྨིན་པར་བྱ་བ་ལ་མངོན་དུ་གྱུར་པར་གནས་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་མོས་པ་རྒྱ་མཚོ་རྣམ་པར་སྦྱང་བ་ལ་མངོན་དུ་གྱུར་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྒྲིབ་པའི་ཆོས་རྣམ་པར་བཟློག་པ་ལ་མངོན་དུ་གྱུར་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་མི་ཤེས་པའི་མུན་པ་རྣམ་པར་བསྩལ་བ་ལ་མངོན་དུ་གྱུར་ཅིང་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་སྣང་བ་ཡོངས་སུ་བསྐྱེད་པའི་དོན་དུ་གནས་པ་མཐོང་ངོ་།
en: focused on holding the teachings of all the tathāgatas; focused on the accumulation of all roots of merit; focused on the increase of all bodhisattva conduct; focused on the minds of all beings being free of obscurations; focused on ripening the faculties of all beings; focused on purifying the ocean of the aspirations of all beings; focused on dispelling obscuring qualities in all beings; focused on dispersing the darkness of ignorance in all beings; and focused on creating the light of omniscient wisdom.

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་མཚན་མོའི་ལྷ་མོ་སེམས་ཅན་ཀུན་ཏུ་སྐྱོང་བའི་གཟི་བརྗིད་དཔལ་གྱི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པའི་ཁྱུ་མཆོག་གི་མཐུ་ཕྱུང་བ་དང་། རྣམ་པར་འཕྲུལ་པ་འཇིག་རྟེན་ཐམས་ཅད་ལ་མངོན་པར་གནས་ཤིང་། འགྲོ་བ་རྣམ་པར་འདུལ་བ་སྟོན་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དེ་ལྟ་བུར་མཐོང་ནས་རབ་ཏུ་དགའ་བ་སྐྱེས་ཏེ། སྤྲོ་བ་ཆེན་པོའི་ཤུགས་དྲག་པོ་རྒྱ་མཚོ་རབ་ཏུ་ཐོབ་ནས།
en: When Sudhana, the head merchant’s son, had seen this miraculous prowess of the night goddess Samanta­sattva­trāṇojaḥ­śrī’s inconceivable bodhisattva liberation called the manifestations that guide beings that appear in all worlds , he was overjoyed and acquired an ocean of the power of great delight.

source: མཚན་མོའི་ལྷ་མོ་སེམས་ཅན་ཀུན་ཏུ་སྐྱོང་བའི་གཟི་བརྗིད་དཔལ་ལ་ལུས་ཐམས་ཅད་ཀྱིས་ཕབ་སྟེ་ཕྱག་བྱས་ནས་ངོར་གྱེན་དུ་བལྟས་སོ།
en: He prostrated with his entire body before the night goddess Samanta­sattva­trāṇojaḥ­śrī and then stood and gazed upon her.

source: །དེ་ནས་མཚན་མོའི་ལྷ་མོ་སེམས་ཅན་ཀུན་ཏུ་སྐྱོང་བའི་གཟི་བརྗིད་དཔལ་གྱིས་བྱང་ཆུབ་སེམས་དཔའི་གཟུགས་དང་། མཚན་རྣམ་པར་དག་པ་རེ་མི་སྣང་བར་བྱས་ཏེ། མཚན་མོའི་ལྷ་མོའི་གཟུགས་སུ་བྱས་ཏེ། རྣམ་པར་འཕྲུལ་པ་ཐམས་ཅད་འབྱིན་ཅིང་འདུག་པར་གནས་སོ།
en: Then the night goddess Samanta­sattva­trāṇojaḥ­śrī made her appearance in the pure form and physical signs of a bodhisattva vanish, and she remained in the form of a night goddess emanating all miraculous manifestations.

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་མཚན་མོའི་ལྷ་མོ་སེམས་ཅན་ཀུན་ཏུ་སྐྱོང་བའི་གཟི་བརྗིད་དཔལ་གྱི་མདུན་དུ་འདུག་སྟེ། ཐལ་མོ་སྦྱར་ནས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ།
en: At that time, Sudhana, the head merchant’s son, standing with hands together in homage before the night goddess Samanta­sattva­trāṇojaḥ­śrī, recited these verses to her:

source: །ཁྱོད་ཀྱི་སྐུ་ཡང་མཚན་རབ་རྒྱན་གྱིས་བརྒྱན།
en: “I have seen your vast body

source: །ཤིན་ཏུ་བཟང་ཞིང་མཛེས་པ་བདག་གིས་མཐོང་།
en: Adorned by the excellent, beautiful signs And the wonderful special features,

source: །ནམ་མཁའ་སྐར་མའི་ཚོགས་ཀྱིས་བརྒྱན་པ་བཞིན། །དཔེ་བྱད་བཟང་པོས་རྣམ་པར་བྲིས་པ་མཐོང་།
en: Like the sky adorned by stars.

source: །འོད་ཀྱི་འཁོར་ཅན་སྐུ་བཟང་དམ་པའི་མཆོག །མཐའ་ཡས་ཞིང་གི་རྡུལ་ཁམས་མང་པོ་སྙེད།
en: “Your perfect, beautiful body’s halo of light rays As numerous as the atoms in infinite realms,

source: །ཁ་དོག་སྣ་ཚོགས་རྣམ་པའི་དཔེ་ཚུལ་དུ།
en: With its multicolored, incomparable radiance,

source: །ཕྱོགས་རྣམས་ཀུན་གྱི་དབྱིངས་སུ་ཁྱབ་པར་གང་།
en: Spreads throughout the extent of every direction. “From the pores of your body shine

source: །འོད་ཟེར་དྲ་བ་མང་པོ་འགྲོ་སེམས་མཉམ།
en: As many networks of light rays as there are minds of beings.

source: །ཁྱོད་ཀྱི་བ་སྤུའི་སྒོ་ནས་འགྱེད་པ་མཛད། །འོད་ཟེར་སྒོ་ལ་པདྨོའི་ཡིད་འོང་གནས།
en: At the tip of each light ray an emanation of yours,

source: །ཁྱོད་ཀྱི་སྤྲུལ་པ་འགྲོ་བའི་སྡུག་བསྔལ་སེལ།
en: Seated upon a beautiful lotus, eliminates the sufferings of beings.

source: །སྤོས་ཀྱི་ན་བུན་སྤྲིན་དུ་ཆགས་པ་འགྱེད།
en: “Clouds of incense mists are emitted,

source: །འགྲོ་བའི་གཟུགས་སུ་གནས་ཏེ་ཀུན་ནས་མཛེས།
en: Taking on the forms of beautiful beings.

source: །མེ་ཏོག་སྒོ་རྣམས་ཀུན་ནས་དགྱེ་མཛད་པས།
en: Flowers spread out everywhere

source: །ཆོས་དབྱིངས་བཞུགས་པའི་རྒྱལ་བ་ཀུན་ཏུ་ཁྱབ།
en: To all the jinas in the realm of phenomena.

source: །ཁྱོད་ཀྱི་ཕྲག་པའི་ལྷུན་ཡངས་འཕགས་པ་ནི།
en: “The vast, sublime mass of your shoulders

source: །རིན་ཆེན་འོད་འཕྲོ་རི་བོ་རི་རབ་འདྲ།
en: Shines with stainless jewel light, the size of Mount Meru,

source: །དྲི་མེད་དེ་ནི་འགྲོ་བ་ཀུན་ཏུ་གསལ།
en: With which you illuminate all beings,

source: །གཏི་མུག་མུན་ནག་རྣམ་པར་བཟློག་པ་མཛད།
en: Dispelling the darkness of ignorance. “Vast masses of clouds of suns are emanated

source: །ཁྱོད་ཀྱི་དྲི་མེད་ཞལ་མདོག་བཟང་བ་ལས།
en: From your beautifully colored, stainless face.

source: །ན་བུན་སྤྲིན་དང་ཉི་མ་ཡངས་པ་འབྱུང་། །ཁྱོད་ཀྱི་ཉི་མའི་འཁོར་འདྲ་འོད་བཟང་བ།
en: Your wonderful light, which is like the disk of the sun,

source: །རྣམ་པར་སྣང་མཛད་སྤྱོད་ཡུལ་ཡངས་པ་འབྱིན།
en: Is emanated throughout Vairocana’s vast field of activity.

source: །ཁྱོད་ཀྱི་སྤྱན་ནས་ཟླ་སྐར་འོད་འབྱུང་བ།
en: “Clouds of the stainless light of the moon and the stars

source: །རྟག་ཏུ་དྲི་མེད་སྤྲིན་ལྟར་མང་བ་སྟེ།
en: Are constantly emanated from your eyes.

source: དེ་དག་ཕྱོགས་བཅུར་བཀང་ཞིང་འགྲོ་བ་རྣམས།
en: They spread throughout the ten directions,

source: །རབ་ཏུ་སྣང་བྱེད་འཇིག་རྟེན་རབ་རིབ་སེལ།
en: Illuminating beings and eliminating the world’s blindness. “An ocean of emanations as numerous as the bodies of beings

source: །ཁྱོད་ཀྱི་མཚན་ལས་འགྲོ་བའི་ལུས་མཉམ་པའི། །སྤྲུལ་པ་རྒྱ་མཚོ་ཕྱོགས་སུ་ཁྱབ་པར་འཕྲོ།
en: Is emanated into all directions from your physical signs of a great being.

source: །དེ་དག་ཆོས་དབྱིངས་ཡངས་པར་རྒྱས་འགེངས་ཤིང་།
en: They spread throughout the vast realm of phenomena

source: །སེམས་ཅན་ཚད་མེད་ཚོགས་རྣམས་ཡོངས་སུ་འདུལ།
en: And guide the immeasurable multitudes of beings.

source: །ཁྱོད་ཀྱི་སྐུ་ནི་འབྱམ་ཀླས་ཕྱོགས་སུ་སྣང་།
en: “Your body appears throughout the extent of the directions,

source: །འགྲོ་བ་ཀུན་ལ་མངོན་གྱུར་དགའ་བ་བསྐྱེད།
en: Appearing to all beings and bringing them happiness,

source: །རྒྱལ་པོ་མེ་དང་རྐུན་པོ་ཆུས་བསྐྱེད་པའི། །འཇིགས་པ་ཐམས་ཅད་རྣམ་སེལ་ཞི་བར་མཛད།
en: Dispelling and alleviating all fears Created by kings, fire, thieves, and water.

source: །གང་ཚེ་ཁྱོད་ཀྱི་སྤྱན་སྔར་བདག་བཏང་ནས།
en: “When I was sent into your presence,

source: །ཡོན་ཏན་རྣམ་པར་སེམས་ཤིང་ཉེར་ཕྱིན་པ།
en: I approached you contemplating good qualities.

source: །དེའི་ཚེ་འོད་ཟེར་དྲི་མེད་འཁོར་བཟང་བ།
en: At that time a beautiful, stainless mass of light rays

source: །ཁྱོད་ཀྱི་ཞལ་གྱི་སྨིན་མཚམས་གསེབ་ནས་འཐོན།
en: Radiated from between your eyebrows.

source: །ཕྱོགས་རྣམས་རྒྱ་མཚོ་བརྒྱ་མང་སྣང་མཛད་ནས།
en: “They illuminated hundreds of oceans of directions

source: །འཇིག་རྟེན་སྣང་བ་རྒྱ་ཆེ་ཡོངས་བསྐྱེད་དེ།
en: And created a vast radiance in the world.

source: །རྣམ་འཕྲུལ་རྣམ་པ་མང་པོ་རྣམ་བསྟན་ནས།
en: They revealed many miraculous manifestations,

source: །དེ་ཚེ་བདག་གི་ལུས་ཀྱི་གསེབ་ཏུ་ཞ།
en: And at that time they entered into my body.

source: །གང་ཚེ་འོད་ཀྱི་འཁོར་གྱིས་བདག་རེག་པ།
en: “When that mass of light touched me,

source: །དེ་ཚེ་བདེ་བ་རྨད་བྱུང་ཡངས་པ་མྱོང་།
en: At that time I experienced a marvelous bliss.

source: །གཟུངས་དང་ཏིང་འཛིན་བརྒྱ་མང་ཡོངས་སུ་གནོན།
en: I gained mastery of many hundreds of dhāraṇīs and samādhis,

source: །ཕྱོགས་བཅུའི་རྒྱལ་བ་དཔག་ཡས་མཐོང་བར་འགྱུར།
en: And I saw limitless jinas in the ten directions.

source: །གོམ་པ་རྣམ་བོར་གྱེན་དུ་བཏེག་པ་ལའང་།
en: “Wherever I stepped with my feet

source: །རྡུལ་ཕྲན་གྲངས་སྙེད་ཚུལ་ནི་བདག་གིས་རིག །རྡུལ་ཕྲན་ཤིན་ཏུ་ཕྲ་བ་གཅིག་ལ་ཡང་།
en: I could perceive the number of atoms there,

source: །ཞིང་གི་རྡུལ་སྙེད་ཞིང་རྣམས་མཐོང་བར་གྱུར།
en: And I saw in every single atom

source: །རྡུལ་ལ་གནས་ཀྱང་རྣམ་པ་ཐ་དགུ་སྟེ།
en: Realms as numerous as a realm’s atoms.

source: །ཞིང་མང་བརྒྱ་ནི་ཤིན་ཏུ་ཉོན་ཡང་མོངས།
en: “There were many hundreds of defiled realms Of many different kinds, located in atoms

source: །དེ་ཡི་འགྲོ་བ་སྡུག་བསྔལ་ཉམས་སུ་མྱོང་།
en: In which beings experienced suffering,

source: །ཆོང་ངེར་ངུ་ཞིང་སྨྲེ་སྔགས་ཡོངས་སུ་འདོན།
en: Crying out with the sounds of lamentation and wailing. “There were also many realms both defiled and pure,

source: །ཞིང་མང་ལ་ལ་ཀུན་ནས་ཉོན་མོངས་དག །དེ་ན་སྡུག་བསྔལ་མང་ཞིང་བདེ་བ་ཆུང་།
en: In which there was much suffering and little happiness,

source: །རྒྱལ་བ་ཐུགས་རྗེ་ཅན་ཡང་དེར་སྐྱེས་ཏེ།
en: In which the compassionate jinas took birth,

source: །རྒྱལ་བའི་ཉན་ཐོས་རང་རྒྱལ་དེ་བཞིན་ནོ།
en: As did the jinas’ śrāvakas and pratyeka­buddhas.

source: །ཞིང་ཚུལ་ལ་ལ་ཡོངས་དག་ཉོན་མོངས་ཏེ།
en: “There were some realms, purified of defilements,

source: །བྱང་ཆུབ་སེམས་དཔའི་གནས་བཟངས་མང་པོས་བརྒྱན།
en: That were ornamented by the presence of many bodhisattvas

source: །སྐྱེས་པ་བུད་མེད་ཡོངས་བརྒྱན་བལྟ་ན་སྡུག །སྐྱོན་མེད་རྒྱལ་བའི་གདུང་ཡང་རྒྱུན་མི་འཆད།
en: And adorned by beautiful men and women, And the brilliant family of the jinas resided there.

source: །ཞིང་རྣམས་རྒྱ་མཚོ་ཡངས་ཤིང་དྲི་མེད་པ།
en: “There were vast, stainless oceans of realms,

source: །རྡུལ་ལ་གནས་ཤིང་མཉམ་པའི་གཞི་དང་ལྡན།
en: With level surfaces, that were located in atoms,

source: །དེ་དག་བསྐལ་པ་བརྒྱ་མང་སྔོན་གྱི་ཚེ། །རྣམ་པར་སྣང་མཛད་སྤྱོད་མཛད་ཡོངས་སུ་སྦྱངས།
en: Where for many hundreds of kalpas Vairocana purified his conduct in the past. “Within that entire vast extent of realms,

source: །ཞིང་རྣམས་འབྱམ་ཀླས་ཀུན་ནས་རྒྱལ་བ་དག །ཤིང་དབང་དམ་པའི་དྲུང་དུ་གཤེགས་པ་སྟོན།
en: Jinas were revealed going to the lord of trees,

source: །རྣམ་པར་འཕྲུལ་ཞིང་བྱང་ཆུབ་འཚང་ཡང་རྒྱ།
en: Attaining enlightenment, manifesting miracles,

source: །ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་ཅིང་འདུལ་བ་སྟོན། །རྣམ་པར་སྣང་མཛད་སྤྱོད་ཡུལ་ཡངས་པ་ལ།
en: Turning the wheel of the Dharma, and guiding beings.

source: །ཁྱོད་ཀྱང་ཀུན་ཏུ་རྗེས་སུ་བཞུད་པར་མཐོང་།
en: “And I saw you also following In the vast scope of Vairocana’s activity And making offerings equally to all the jinas

source: །མཆོད་པ་སྟོང་ཕྲག་ཚད་མེད་ཁྲག་ཁྲིག་གིས། །རྒྱལ་བ་ཀུན་ལ་མངོན་པར་མཆོད་མཛད་མཐོང་།
en: With countless millions of billions of offerings.”

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ཚིགས་སུ་བཅད་པ་དེ་དག་སྨྲས་ནས། མཚན་མོའི་ལྷ་མོ་སེམས་ཅན་ཀུན་ཏུ་སྐྱོང་བའི་གཟི་བརྗིད་དཔལ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ལྷ་མོ་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་དེ། དེ་ལྟ་བུ་ཟབ་པ་ནི་ངོ་མཚར་ཆེ་ན།
en: When Sudhana, the head merchant’s son, had recited those verses, he said to the night goddess Samanta­sattva­trāṇojaḥ­śrī, “Goddess, that profound bodhisattva liberation is a great wonder.

source: རྣམ་པར་ཐར་བ་དེའི་མིང་ནི་ཅི་ཞེས་བགྱི།
en: What is the name of that liberation?

source: དེ་ཁྱོད་ཀྱིས་བརྙེས་ནས་ཡུན་ནི་ཇི་སྲིད་ཅིག་ལགས།
en: How long ago did you attain it?

source: བྱང་ཆུབ་སེམས་དཔས་ཇི་ལྟར་ནན་ཏན་དུ་བགྱིས་ན་རྣམ་པར་ཐར་པ་དེ་ཡོངས་སུ་དག་པར་འགྱུར།
en: How does a bodhisattva practice in order to purify that bodhisattva liberation?”

source: སྨྲས་པ་རིགས་ཀྱི་བུ་གནས་འདི་ནི་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་དང་། ཉན་ཐོས་དང་རང་སངས་རྒྱས་སུ་བཅས་པས་ཡིད་ཆེས་པར་དཀའ་བ་སྟེ།
en: The night goddess Samanta­sattva­trāṇojaḥ­śrī said, “Noble one, this subject is difficult to believe in for the world and its devas, as well as for the śrāvakas and pratyeka­buddhas.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why is that?

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་དང་། སྨོན་ལམ་ཁོང་དུ་ཆུད་པ་རྣམས་ཀྱི་སྤྱོད་ཡུལ་ཏེ།
en: Because it is the field of practice of those bodhisattvas who follow the completely good conduct and prayer of the bodhisattvas;

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སྙིང་རྗེ་ཆེན་པོ་ལྷུར་ལེན་པ།
en: who are dedicated to the essence of compassion;

source: འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབ་པ་ལ་ཞུགས་པ།
en: who are engaged in saving all beings;

source: མི་ཁོམ་པ་དང་ངན་སོང་དང་། ངན་འགྲོའི་ལམ་ཐམས་ཅད་རྣམ་པར་བཟློག་པ་ལ་ཞུགས་པ།
en: who purify the paths that lead to all unfortunate and lower realms;

source: སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ། བླ་ན་མེད་པར་བྱ་བ་ལ་ཞུགས་པ།
en: who purify all realms to become the highest buddha realms;

source: སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ན་བཞུགས་པའི་དེ་བཞིན་གཤེགས་པའི་རིགས་རྒྱུན་མི་གཅད་པ་ལ་ཞུགས་པ།
en: who create the unbroken continuity of the Buddha’s family in all buddha realms;

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་བསྟན་པ་ཡོངས་སུ་གཟུང་བ་ལ་ཞུགས་པ།
en: who hold the teachings of all the buddhas;

source: བསྐལ་པ་ཐམས་ཅད་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་གནས་པས། གནས་པར་བྱ་བའི་སྨོན་ལམ་ཆེན་པོ་རྒྱ་མཚོ་ལ་ཞུགས་པ།
en: who have oceans of great prayers for remaining in the practice of bodhisattva conduct throughout all kalpas;

source: ཆོས་རྒྱ་མཚོ་ཐམས་ཅད་ལ་བསྒྲིབས་པ་མེད་པའི་ཡེ་ཤེས་སྣང་བ་རྣམ་པར་སྦྱང་བ་ལ་ཞུགས་པ།
en: and who create the pure light of wisdom, free of darkness, for all the oceans of Dharma;

source: སྐད་ཅིག་རེ་རེ་ཞིང་དུས་གསུམ་གྱི་ཚུལ་རྒྱ་མཚོ་ཐམས་ཅད་དུ་ཡེ་ཤེས་སྣང་བས། རྣམ་པར་གནས་པ་རབ་ཏུ་ཐོབ་པ་རྣམས་ཀྱི་ཡུལ་ཏེ།
en: and those bodhisattvas who in each instant have attained the state of remaining in the light of wisdom of the entire ocean of the ways of the three times.

source: འོན་ཀྱང་དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་ཀྱིས་བསྟན་པར་བྱའོ།
en: However, through the blessing of the Tathāgata, I will teach it.

source: །རིགས་ཀྱི་བུ་སྔོན་འདས་པའི་དུས་བསྐལ་པ་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཅིག་གི་ཕ་རོལ་ཏུ་འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་སྣང་མཛད་གཟི་བརྗིད་དཔལ་ཞེས་བྱ་བར་བསྐལ་པ་རྡུལ་དང་བྲལ་བའི་དཀྱིལ་འཁོར་ཅེས་བྱ་བ་བྱུང་སྟེ།
en: “Noble one, in the past beyond kalpas as numerous as the atoms in a buddha realm, there was a world realm called Vairocana­tejaḥśrī during a kalpa called Virajomaṇḍala.

source: བསྐལ་པ་དེ་ལས་སངས་རྒྱས་རི་རབ་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་བར་གྱུར་ཏོ།
en: In that kalpa there appeared as many buddhas as there are atoms in Sumeru

source: །འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་སྣང་མཛད་གཟི་བརྗིད་དཔལ་ཞེས་བྱ་བ་དེ་ནི་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་སྤྲིན་གྱི་རྒྱན་གྱིས་བརྒྱན་པ་སྟེ། རྡོ་རྗེ་ལས་བྱས་པའི་གཞལ་མེད་ཁང་དང་། གནས་ཀྱིས་ཡོངས་སུ་མཛེས་པར་བྱས་པའོ།
en: In that world realm called Vairocana­tejaḥśrī there was an array of clouds of all jewels, and it was beautified by aerial palaces made of diamonds.

source: །འཇིག་རྟེན་གྱི་ཁམས་དེའི་གཞི་ནི་རིན་པོ་ཆེའི་རྒྱལ་པོ་དྲི་མ་མེད་པའི་འོད་ཀྱི་རྒྱ་མཚོ་ལས་བླངས་པ་སྟེ།
en: “That world realm was situated on a foundation of an ocean of the kings of jewels possessing stainless light.

source: ལྷུན་དང་ལུས་ནི་ནོར་བུ་རིན་པོ་ཆེའི་སྤོས་ཐམས་ཅད་ཀྱི་རྒྱལ་པོ་ལས་གྱུར་པའོ།
en: Its solid body was formed from precious jewels possessing all the kings of perfumes.

source: །དེ་ནི་དབྱིབས་ཀུན་ཏུ་ཟླུམ་པ་སྟེ།
en: It was completely round in shape.

source: རྣམ་པར་དག་ཅིང་ཀུན་ནས་ཉོན་མོངས་པ།
en: It was both pure and defiled.

source: ལྷབ་ལྷུབ་ཐམས་ཅད་ཀྱི་སྤྲིན་གྱི་བླ་རེས་ཀུན་ནས་ཁྱབ་པ། རིན་པོ་ཆེའི་ཁོར་ཡུག་རྒྱན་ཐམས་ཅད་དང་ལྡན་པ།
en: It was covered by a canopy of clouds of every adornment.

source: རིམ་པ་སྟོང་གིས་ཡོངས་སུ་བསྐོར་བ།
en: It had the array of a thousand precious Cakravāla mountains.

source: གླིང་བཞི་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་གིས་ཤིན་ཏུ་རྒྱས་པར་བརྒྱན་པ་སྟེ།
en: It was adorned by a quintillion four-continent worlds.

source: དེ་ལ་གླིང་བཞི་པ་ལ་ལ་ནི་ཀུན་ནས་ཉོན་མོངས་པ་སྟེ། སེམས་ཅན་ཀུན་ནས་ཉོན་མོངས་པའི་ལས་དང་ལྡན་པ་རྣམས་ཀྱི་གནས་སོ། །ལ་ལ་ནི་ཀུན་ནས་ཉོན་མོངས་ཤིང་རྣམ་པར་དག་པ་སྟེ།
en: Some four-continent worlds were defiled and were the dwelling places of beings who had defiled karma.

source: སེམས་ཅན་ལས་འདྲེན་མ་དང་ལྡན་པ་རྣམས་ཀྱི་གནས་སོ། །ལ་ལ་ནི་རྣམ་པར་དག་ཅིང་ཀུན་ནས་ཉོན་མོངས་པ་སྟེ།
en: Some were the dwelling places of beings who had a mixture of both defiled and pure karma.

source: སེམས་ཅན་ཡོངས་སུ་དག་ཅིང་ཀུན་ནས་ཉོན་མོངས་པ་དགེ་བའི་རྩ་བ་སྦྱངས་པ། ཁ་ན་མ་ཐོ་བ་ཉུང་བ་རྣམས་ཀྱི་གནས་སོ། །ལ་ལ་ནི་ཤིན་ཏུ་ཡོངས་སུ་དག་པ་སྟེ།
en: Some were the dwelling places of beings who were pure and also defiled, who had pure good actions and few blameworthy actions.

source: བྱང་ཆུབ་སེམས་དཔའ་དག་པ་རྣམས་ཀྱི་གནས་སོ།
en: Some were the dwelling places of pure bodhisattvas.

source: །འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་སྣང་མཛད་གཟི་བརྗིད་དཔལ་ཞེས་བྱ་བ་དེའི་ཤར་ཕྱོགས་ལོགས་ཀྱི་ཁོར་ཡུག་གི་མཚམས་ན། གླིང་བཞི་བའི་རིན་ཆེན་མེ་ཏོག་སྒྲོན་མའི་རྒྱལ་མཚན་ཞེས་བྱ་བ་རྣམ་པར་དག་ཅིང་ཀུན་ནས་ཉོན་མོངས་པ།
en: “To the east of the world realm Vairocana­tejaḥśrī, next to the Cakravāla mountains, there was a four-continent world called Ratna­kusuma­pradīpa­dhvajā. It was pure but defiled.

source: མ་རྨོས་མ་བསྐྱེད་པའི་འབྲས་ལ་ཡོངས་སུ་སྤྱོད་པ།
en: There beings enjoyed the unplowed harvests.

source: སྔོན་གྱི་ལས་ཀྱི་རྣམ་པར་སྨིན་པས་མངོན་པར་གྲུབ་པའི་ཁང་པ་བརྩེགས་པའི་གནས་དང་། གཞལ་མེད་ཁང་ལ་ཡོངས་སུ་སྤྱོད་པ།
en: They lived in kūṭāgāras and aerial palaces that were created by the ripening of their past karma.

source: འཁོར་ཀུན་ནས་ཡིད་བཞིན་གྱི་ཤིང་གིས་འཁོར་བ།
en: It was encircled by wish-fulfilling trees.

source: སྤོས་ཀྱི་ཤིང་སྣ་ཚོགས་ཀྱི་ལྷུན་ལས་སྤོས་ཀྱི་སྤྲིན་རྒྱུན་མི་འཆད་པར་འབྱུང་བ།
en: There were various kinds of aromatic trees that continually released clouds of perfume.

source: ཕྲེང་བ་སྣ་ཚོགས་ཀྱི་ཤིང་ལས་ཕྲེང་བའི་སྤྲིན་རྒྱུན་མི་འཆད་པར་འབྱུང་བ།
en: There were various kinds of garland trees that continually released clouds of garlands.

source: མེ་ཏོག་སྣ་ཚོགས་ཀྱི་ཤིང་ལས་མེ་ཏོག་ཁ་དོག་དང་། དྲི་བསམ་གྱིས་མི་ཁྱབ་པའི་སྤྲིན་ཀྱི་ཆར་རྒྱུན་མི་འཆད་པར་འབབ་པ།
en: There were various kinds of flowering trees from which fell a continuous rain of clouds of flowers with inconceivable colors and scents.

source: ཕྱེ་མ་དང་། ཁ་དོག་སྣ་ཚོགས་ཀྱི་ཤིང་གི་ལྷུན་ལས་སྤོས་རིན་པོ་ཆེའི་རྒྱལ་པོ་ཐམས་ཅད་ཀྱི་ཕྱེ་མའི་ཆར་རྒྱུན་མི་འཆད་པར་འབབ་པ།
en: There were various kinds of colored-powder trees from which fell a continuous rain of the powders of all the kings of precious scents.

source: རིན་པོ་ཆེའི་ཤིང་སྣ་ཚོགས་ལས་རིན་པོ་ཆེའི་འབྲུ་མང་པོ་འབྲུལ་བའི། ཁ་དོག་སྣང་བས་ཤིན་ཏུ་སྣང་བར་བྱས་པ།
en: There were various kinds of jewel trees from which fell many jewel seed-pods that shone with various colors.

source: ལྷ་རྫས་ཀྱི་རོལ་མོ་སྣ་ཚོགས་ཀྱི་ཤིང་ལས། སིལ་སྙན་སྣ་ཚོགས་ཀྱི་སྤྲིན་རླུང་གིས་བསྐྱོད་ཅིང་།
en: There were trees of various kinds of divine music from which were emanated clouds of the sound of music.

source: ནམ་མཁའི་དབྱིངས་ལས་སྒྲ་དབྱངས་སྙན་པ་འབྱུང་བ།
en: From the sky came melodious sounds.

source: ཉིན་མཚན་གྱི་བདེ་བ་ཉི་མ་དང་ཟླ་བས་འབྱུང་བ།
en: Day and night, there was the pleasant light of the sun and moon.

source: ནོར་བུ་རིན་པོ་ཆེ་ཀུན་ཏུ་སྣང་བས་གཞི་བྱས་པའི་ས་རབ་ཏུ་མཉམ་པར་གྱུར་པ་སྟེ།
en: The ground, which shone with all precious jewels, was level

source: གླིང་བཞི་པ་དེར་རྒྱལ་པོའི། ཕོ་བྲང་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་བྱུང་བར་གྱུར་ཏེ།
en: “In those four continents there were a quintillion royal cities.

source: རྒྱལ་པོའི་ཕོ་བྲང་དེ་དག་རེ་རེ་ཞིང་ཡང་ཆུ་ཀླུང་སྟོང་གིས་ཡོངས་སུ་བསྐོར་བའོ།
en: Each of those royal cities was encircled by a thousand rivers.

source: །ཆུ་ཀླུང་དེ་དག་ཐམས་ཅད་ཀྱང་ལྷ་རྫས་ཀྱི་མེ་ཏོག་སིལ་མས་གང་བའོ།
en: All those rivers were filled with the petals of divine flowers.

source: །ལྷ་རྫས་ཀྱི་རོལ་མོ་དང་། གླུའི་སྒྲ་སྐད་སྙན་ཅིང་ཡིད་དུ་འོང་བ་འབྱིན་པའོ།
en: They emitted the melodious, beautiful sounds of divine music and song.

source: །ཆུ་འགྲམ་རིན་པོ་ཆེའི་ཤིང་ཡིད་དུ་འོང་བས་རྣམ་པར་བརྒྱན་པའོ།
en: Their banks were adorned by beautiful precious trees.

source: །རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་ཤིན་ཏུ་བརྒྱན་པའི་གྲུ་ཕན་ཚུན་དུ་རྒྱུ་བའོ།
en: Boats adorned by various jewels crossed back and forth.

source: །བདེ་བ་སྣ་ཚོགས་ཅི་དགའ་བར་ཡོངས་སུ་སྤྱད་དུ་ཡོད་པའོ།
en: Every kind of happiness that could be delighted in was enjoyed there.

source: །ཆུ་ཀླུང་གི་མཚན་མས་ཀྱི་གཞི་རེ་རེ་དག་ན་འང་། གྲོང་ཁྱེར་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བཅུ་ཀུན་ནས་གནས་པ་སྟེ།
en: In between each river a quintillion towns had been established.

source: གྲོང་ཁྱེར་དེ་དག་རེ་རེ་ཞིང་ཡང་གྲོང་རྡལ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་གིས་ཡོངས་སུ་བསྐོར་བའོ།
en: Each of those towns was encircled by a quintillion markets.

source: །གྲོང་དང་གྲོང་ཁྱེར་དང་གྲོང་རྡལ་དེ་དག་ཐམས་ཅད་ཀྱང་ལྷ་རྫས་ཀྱི་བཟའ་ཤིང་གི་ར་བ་དང་། གཞལ་མེད་ཁང་དང་། ཁང་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་གི་འཁོར་གྱིས་ཡོངས་སུ་བསྐོར་བའོ།
en: All those villages, cities, and markets were encircled by a quintillion divine parks, aerial palaces, and mansions.

source: །གླིང་བཞི་པ་དེའི་འཛམ་བུའི་གླིང་གི་དབུས་ན་རྒྱལ་པོའི་ཕོ་བྲང་དབུ་མ་རིན་པོ་ཆེའི་མེ་ཏོག་སྒྲོན་མ་ཞེས་བྱ་བ་ཡོད་པར་གྱུར་ཏོ།
en: In the center of the Jambudvīpa of that four-continent world was the central royal city, which was called Ratna­kusuma­pradīpā.

source: །དེ་ནི་སྐྱིད་ཅིང་ལོངས་སྤྱོད་ཕུན་སུམ་ཚོགས་པ་དང་ལྡན་ལ། རྟག་དུ་ལོ་ལེགས་ཤིང་བདེ་བའི་རྣམ་པ་ཐམས་ཅད་དང་ལྡན་པའོ། །ལྷ་དང་མི་མང་པོས་ཡོངས་སུ་གང་བའོ། །སེམས་ཅན་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་དང་ལྡན་པ་རྣམས་ཀྱི་གནས་སུ་གྱུར་པ་སྟེ།
en: “This was a place that was prosperous and wealthy, with an abundance of food; it had every kind of happiness and was filled with many devas and humans, and the beings there followed the path of the ten good actions.

source: རྒྱལ་པོའི་ཕོ་བྲང་རིན་པོ་ཆེ་མེ་ཏོག་སྒྲོན་མ་ཞེས་བྱ་བ་དེ་ན་རྒྱལ་པོ་རྣམ་པར་སྣང་བ་རིན་ཆེན་པད་མོ་དཔལ་གྱི་གཙུག་ཕུད་སྙིང་པོ་ཞེས་བྱ་བ་འཁོར་ལོས་སྒྱུར་བ།
en: “Here dwelled King Vairocana­ratna­padma­garbha­śrī­cūḍa , a cakravartin who was sovereign over the four continents.

source: གླིང་བཞི་ལ་དབང་བ་པད་མོའི་སྙིང་པོ་ལས་རྫུས་ཏེ་བྱུང་བ། མི་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་ལུས་ཤིན་ཏུ་བརྒྱན་པ་ཆོས་དང་ལྡན་པ་ཆོས་ཀྱི་རྒྱལ་པོ་རིན་པོ་ཆེ་བདུན་དང་ལྡན་པ་གནས་པར་གྱུར་ཏོ།
en: He had been spontaneously born from the center of a lotus flower, was adorned by the thirty-two signs of a great being, was a follower of the Dharma, a Dharma king, and possessed the seven jewels of a cakravartin.

source: །དེའི་བུ་དཔའ་ཞིང་རྡུལ་ཕོད་ལ་ཡན་ལག་དམ་པའི་གཟུགས་དང་ལྡན་པ། གཞན་གྱི་འཁོར་རབ་ཏུ་འཇོམས་པ། རྣམ་པ་ཐམས་ཅད་ཡོངས་སུ་ཚང་བའི་ཡན་ལག་དམ་པ་དང་ལྡན་པ་སྟོང་ཚང་བར་བྱུང་ང་ངོ་།
en: “He had a full thousand sons who were courageous and heroic, who had perfectly formed bodies, who crushed the armies of enemies and had perfect bodies fully formed in all aspects.

source: །དེའི་བཙུན་མོའི་འཁོར་གྱི་བུད་མེད་ཀྱང་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བཅུ་ཡོད་པར་གྱུར་ཏོ། །དེ་དག་ཀུན་ཀྱང་འཁོར་ལོས་སྒྱུར་བའི་སྐལ་བ་དང་མཉམ་པའི་དགེ་བའི་རྩ་བ་ལས་བྱུང་བ་མཐུན་པར་སྤྱོད་པ་རིན་པོ་ཆེའི་རྒྱན་རང་འཁྲུངས་སུ་བྱུང་བ། དགེ་བའི་སེམས་དང་ལྡན་པ། ལྷའི་བུ་མོ་དང་ཁྱད་པར་མེད་པར་འདྲ་བའི་གཟུགས་ཅན། འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་གྱི་ཁ་དོག་ལྟ་བུའི་མདོག་དང་ལྡན་པའི་ལུས་ཅན། ལུས་ཀྱི་བ་སྤུ་ལས་ལྷ་རྫས་ཀྱི་སྤོས་སྣ་ཚོགས་འབྱུང་བ། ལུས་ལས་ལྷ་རྫས་ཀྱི་འོད་དྲི་ཞིམ་པོ་དྲི་མ་མེད་པར་རབ་ཏུ་འགྱེད་པ་ཤ་སྟག་གོ།
en: “In his harem there were a quintillion women, all of whom had originated from roots of merit that corresponded to those of the cakravartin, who had the same conduct as he had, were born adorned with jewels, had virtuous minds, and had bodies that were no different from those of goddesses, bodies that were the color of Jambu River gold, that emitted various divine scents from the pores of their bodies, and that shone with a pure, aromatic, divine light.

source: །དེའི་བློན་པོ་བྱེ་བ་ཕྲག་བཅུ་བྱུང་སྟེ་བློན་པོ་རིན་པོ་ཆེ་ལ་སྩོགས་པ་དག་གོ །འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་རྣམ་པར་སྣང་བ་རིན་ཆེན་པད་མོ་དཔལ་གྱི་གཙུག་ཕུད་སྙིང་པོ་དེའི་བཙུན་མོ་དམ་པ་བུད་མེད་རིན་པོ་ཆེ་དཔལ་གྱི་བཞིན་ཡོངས་སུ་རྒྱས་པ་ཞེས་བྱ་བ་གཟུགས་མཛེས་ཤིང་སྡུག་ལ།
en: “He had millions of ministers such as the precious prime minister. “The cakravartin king Vairocana­ratna­padma­garbha­śrī­cūḍa ’s queen named Saṃpūrṇa­śrīvakrā was the precious woman.

source: བལྟ་ན་ཡིད་དུ་འོང་བ་ཁ་དོག་བཟང་པོ་ཤིན་ཏུ་རྒྱས་པའི་དམ་པ་དང་ལྡན་པ།
en: She was beautiful, attractive, and lovely to look at. She possessed an excellent, magnificent, perfect color.

source: སྐྲ་མཐོན་ཏིང་དུ་འདུག་པ།
en: Her hair was deep black.

source: མིག་དཀར་ནག་འབྱེས་པ། མདོག་གསེར་གྱི་ཁ་དོག་དུ་འདུག་པ།
en: She had deep black eyes. She had golden skin.

source: ཚངས་པའི་དབྱངས་དང་ལྡན་པ།
en: She had the voice of Brahmā.

source: ལུས་ལས་འོད་རྟག་ཏུ་འབྱུང་བ།
en: Light continually shone from her body.

source: འཁོར་ཀུན་ཏུ་དཔག་ཚད་སྟོང་གི་ཚད་དུ་འོད་ཁ་དོག་དུ་མ་དང་ལྡན་པ། ལྷ་རྫས་ཀྱི་དྲི་ཞིམ་པོ་ཅན་འགྱེད་པ་བྱུང་ངོ་།
en: She spread lights of various colors and divine aromas for a thousand yojanas around her.
